use navigator;

insert into Countries(name) values ("belarus");

insert into Regions(country_id, name) values
(1, "Могилевский"),
(1, "Брестский"),
(1, "Минский"),
(1, "Гомельский"),
(1, "Гродненский"),
(1, "Витебский");

insert into Cities(region_id, name) values
(3, "Минск");

insert into Districts(city_id, name) values
(1, "Фрунзенский район"),
(1, "Центральный район"),
(1, "Минский район"),
(1, "Ленинский район"),
(1, "Советский район");

insert into Streets(district_id, name) values
(1, "ул. Притыцкого"),
(2, "пр-т. Победителей"),
(3, "МКАД"),
(4, "ул. Ташкентская"),
(4, "пр-т. Рокоссовкого"),
(5, "ул. Кольцова");

insert into Point_types(name) values
("Арена"),
("Торговый центр"),
("Аквапарк"),
("Спортивный комплекс");

insert into Points(`name`, latitude, longitude, street_id, type_id, `description`) values
("дом 156, GREEN", 53.91021, 27.43475, 1, 2, 'Хорошее место для отдыха. Чижовка Арена была построена для проведения чемпионата мира по хоккею.'),
("дом 120, Лебяжий", 53.95589, 27.45121, 2, 3, 'Большой аквапарк с крытыми и открытыми горками, бассейнами, "медленной рекой", спа и залом игровых автоматов.'),
("50-й км, EXPOBEL", 53.96811, 27.62250, 3, 2, 'Торговый центр с разнообразными магазинами и киосками, ресторанами быстрого питания и гипермаркетом BIGZZ.'),
("дом 19 ЧИЖОВКА-АРЕНА", 53.84736, 27.62559, 4, 4, null),
("дом 44 Теннисный центр", 53.87045, 27.58989, 5, 4, null),
("дом 6 Теннисный клуб", 53.96302, 27.59375, 6, 4, null);

insert into Transitions(point_from_id, point_to_id) values
(2, 6),
(1, 6),
(1, 5),
(5, 1),
(6, 3),
(5, 3),
(5, 4),
(3, 4);
